WingV5/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    wing
    {
        type            wall;
        inGroups        1(wall);
        nFaces          390;
        startFace       5385;
    }
    inout
    {
        type            patch;
        nFaces          390;
        startFace       5775;
    }
    sym
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          130;
        startFace       6165;
    }
)

// ************************************************************************* //
